In [ ]:
import pandas as pd;
import numpy as np;
import matplotlib.pyplot as plt
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import LabelEncoder
from sklearn.preprocessing import StandardScaler
from sklearn.linear_model import LinearRegression

Import dataset

In [ ]:
df=pd.read_csv("/content/drive/MyDrive/datasets/medical_cost+personal_datasets/insurance.csv")

check for the features

In [ ]:
df.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [ ]:
df.describe()

               age          bmi     children       charges
count  1338.000000  1338.000000  1338.000000   1338.000000
mean     39.207025    30.663397     1.094918  13270.422265
std      14.049960     6.098187     1.205493  12110.011237
min      18.000000    15.960000     0.000000   1121.873900
25%      27.000000    26.296250     0.000000   4740.287150
50%      39.000000    30.400000     1.000000   9382.033000
75%      51.000000    34.693750     2.000000  16639.912515
max      64.000000    53.130000     5.000000  63770.428010

Visualize data

In [ ]:
#plt.plot(df.region.df.charges)

In [ ]:
df1=df.groupby('age').mean()

Remove y

In [ ]:
x=df.iloc[:,0:-1]
y=df.iloc[:,-1]

#Taking care of catogrical data

checking gender

In [ ]:
gender=x.sex
x.drop('sex',axis=1)
sexEncoder=LabelEncoder().fit(gender)
gender=sexEncoder.transform(gender)
gender
x['sex']=pd.DataFrame(gender).values
x

      age  sex     bmi  children smoker     region
0      19    0  27.900         0    yes  southwest
1      18    1  33.770         1     no  southeast
2      28    1  33.000         3     no  southeast
3      33    1  22.705         0     no  northwest
4      32    1  28.880         0     no  northwest
...   ...  ...     ...       ...    ...        ...
1333   50    1  30.970         3     no  northwest
1334   18    0  31.920         0     no  northeast
1335   18    0  36.850         0     no  southeast
1336   21    0  25.800         0     no  southwest
1337   61    0  29.070         0    yes  northwest

[1338 rows x 6 columns]

region

In [ ]:
region=x.region
x=x.drop('region',axis=1)
regionEncoder=LabelEncoder().fit(region)
region=regionEncoder.transform(region)
x['region']=pd.DataFrame(region).values
x

      age  sex     bmi  children smoker  region
0      19    0  27.900         0    yes       3
1      18    1  33.770         1     no       2
2      28    1  33.000         3     no       2
3      33    1  22.705         0     no       1
4      32    1  28.880         0     no       1
...   ...  ...     ...       ...    ...     ...
1333   50    1  30.970         3     no       1
1334   18    0  31.920         0     no       0
1335   18    0  36.850         0     no       2
1336   21    0  25.800         0     no       3
1337   61    0  29.070         0    yes       1

[1338 rows x 6 columns]

smoker encoder

In [ ]:
smoker=x.smoker
x=x.drop('smoker',axis=1)
smokerEncoder=LabelEncoder().fit(smoker)
smoker=smokerEncoder.transform(smoker)
x['smoker']=pd.DataFrame(smoker).values
x

      age  sex     bmi  children  region  smoker
0      19    0  27.900         0       3       1
1      18    1  33.770         1       2       0
2      28    1  33.000         3       2       0
3      33    1  22.705         0       1       0
4      32    1  28.880         0       1       0
...   ...  ...     ...       ...     ...     ...
1333   50    1  30.970         3       1       0
1334   18    0  31.920         0       0       0
1335   18    0  36.850         0       2       0
1336   21    0  25.800         0       3       0
1337   61    0  29.070         0       1       1

[1338 rows x 6 columns]

#scaling of data

Scaling bmi

In [ ]:
bmi=x.bmi
x.drop('bmi',axis=1)
bmi=bmi.to_numpy()
bmi=bmi.reshape(-1,1)
bmiScaler=StandardScaler().fit(bmi)
bmi=bmiScaler.transform(bmi)
x['bmi']=pd.DataFrame(bmi).values
x

      age  sex       bmi  children  region  smoker
0      19    0 -0.453320         0       3       1
1      18    1  0.509621         1       2       0
2      28    1  0.383307         3       2       0
3      33    1 -1.305531         0       1       0
4      32    1 -0.292556         0       1       0
...   ...  ...       ...       ...     ...     ...
1333   50    1  0.050297         3       1       0
1334   18    0  0.206139         0       0       0
1335   18    0  1.014878         0       2       0
1336   21    0 -0.797813         0       3       0
1337   61    0 -0.261388         0       1       1

[1338 rows x 6 columns]

#Train test split

In [ ]:
x_train,x_test,y_train,y_test=train_test_split(x,y)

In [ ]:
x

      age  sex       bmi  children  region  smoker
0      19    0 -0.453320         0       3       1
1      18    1  0.509621         1       2       0
2      28    1  0.383307         3       2       0
3      33    1 -1.305531         0       1       0
4      32    1 -0.292556         0       1       0
...   ...  ...       ...       ...     ...     ...
1333   50    1  0.050297         3       1       0
1334   18    0  0.206139         0       0       0
1335   18    0  1.014878         0       2       0
1336   21    0 -0.797813         0       3       0
1337   61    0 -0.261388         0       1       1

[1338 rows x 6 columns]

In [ ]:
y

0       16884.92400
1        1725.55230
2        4449.46200
3       21984.47061
4        3866.85520
           ...
1333    10600.54830
1334     2205.98080
1335     1629.83350
1336     2007.94500
1337    29141.36030
Name: charges, Length: 1338, dtype: float64

#Training my model

In [ ]:
model=LinearRegression().fit(x_train,y_train)
model.score(x_test,y_test)

0.7505586349247263